/**
 * Задача 1. Вложенный массив. Напишите программу, которая будет определять, может ли
 * один массив быть вложен во второй. Массив 1 может быть вложен в массив 2, если:
 * Минимальный элемент массива 1 больше, чем минимальный элемент массива 2.
 * Максимальный элемент массива 1 меньше, чем максимальной элемент массива 2.
 * Входные данные: На вход подается два массива элементов типа Integer.
 * Выходные данные: Вывод в консоль true, если первый массив может быть вложен во второй,
 * и false в противном случае.
 */

package inc.lopsys.idk.homework2.task1;

public class Main {
    public static void main(String[] args) {

        Integer[] array1 = {3, 5, 7};
        Integer[] array2 = {2, 4, 6, 8};

        if (array1[0] > array2[0] & array1[array1.length - 1] < array2[array2.length - 1]) {
            System.out.println(true);
        }
        else {
            System.out.println(false);
        }
    }
}
